{
  "code": "5.08",
  "parentCode": "5",
  "title": "General Cleaning",
  "appliesTo": [
    "facility cleaning",
    "waste management",
    "housekeeping",
    "cleaning tools",
    "cross-contamination prevention"
  ],
  "description": "General facility cleaning requirements including waste management, debris control, cleaning tool management, housekeeping standards, and prevention of cross-contamination during cleaning activities",
  "requirements": [
    {
      "code": "5.08.01",
      "question": "Are spills cleaned up immediately?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.02",
      "question": "Are waste and garbage frequently removed from production and storage areas?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.03",
      "question": "Are floor drains and waste trap systems constructed and located so they can be easily cleaned, do they appear clean, free from odors, in good repair, and flow in a manner that prevents contamination (e.g., from high to low risk areas, from high risk directly to drain system)?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.04",
      "question": "Do high level areas, including overhead pipes, ducts, conduit, etc., appear clean?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.05",
      "question": "Are plastic strip curtains maintained in good condition, kept clean and mounted so that the tips are not touching the floor?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.06",
      "question": "Is personal protection equipment (PPE) for the sanitation crew in good condition and stored to prevent cross contamination to raw products, work in progress, ingredients, finished goods or packaging?",
      "totalPoints": 3,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.07",
      "question": "Is cleaning equipment maintained clean and stored properly?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.08",
      "question": "Is cleaning equipment identified in order to prevent potential cross-contamination issues (e.g., production, maintenance, outside, restroom equipment)?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.09",
      "question": "Are all items used for sanitation appropriate for their designated purpose (e.g., no steel wool, metal bristles, etc.)?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.10",
      "question": "Are toilet facilities and hand washing stations clean?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.11",
      "question": "Are worker break facilities clean, including microwaves and refrigerators, and no rotting or out of date foodstuffs?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.12",
      "question": "Is the maintenance shop organized, with equipment and spares stored in a neat and tidy fashion?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.13",
      "question": "Are internal transport vehicles (e.g., forklifts, bobcats, pallet jacks, carts, floor cleaners, etc.), clean, do not emit toxic fumes and are being used in a sanitary manner?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.08.14",
      "question": "Are shipping trucks clean and in good condition?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement immediate spill response protocols with designated spill kits located throughout the facility and trained personnel available at all times during operations.",
    "Establish waste removal schedules with documented frequency requirements and corrective actions when waste accumulates beyond acceptable limits.",
    "Create drain and waste trap cleaning procedures with scheduled deep cleaning, inspection protocols, and corrective actions for odors or backup situations.",
    "Develop overhead area cleaning schedules using designated high-reach equipment and document findings of dust, debris, or pest evidence with corrective actions.",
    "Implement PPE segregation and storage systems to prevent cross-contamination between sanitation, production, maintenance, and restroom areas with color-coding or labeling."
  ],
  "traceabilityInject": [
    "Maintain spill incident logs showing date, time, location, material spilled, quantity, cleanup actions taken, verification of complete cleanup, and person responsible.",
    "Keep waste removal logs documenting dates, times, areas serviced, waste quantities, disposal destinations, and personnel performing removals.",
    "Document drain cleaning activities showing dates cleaned, methods used, findings of blockages or damage, corrective actions taken, and verification of proper function.",
    "Maintain high-level cleaning logs showing dates, areas cleaned, findings of accumulated dust or debris, corrective actions, and verification signatures.",
    "Keep cleaning equipment usage logs tracking which equipment is used in which areas, cleaning schedules for equipment, findings of damage or contamination, and replacement dates."
  ],
  "micro_inject": [
    "Spills create immediate microbial growth opportunities as product residues provide nutrients for rapid bacterial multiplication; delays in cleanup allow pathogen establishment.",
    "Accumulated waste and garbage serve as attractants for pests while providing harborage and breeding sites for flies, rodents, and other vectors that spread pathogens throughout facilities.",
    "Dirty drains harbor biofilm communities including Listeria monocytogenes that persist despite routine sanitation; drain aerosols and splashing spread these pathogens to nearby surfaces.",
    "Dust accumulation on overhead structures provides nutrients supporting bacterial and mold growth; gravity settling and air currents deposit these contaminants onto products and food contact surfaces below.",
    "Cross-contaminated cleaning equipment transfers pathogens from high-risk areas (restrooms, drains, floors) to food contact surfaces; improper equipment storage allows bacterial growth on moist cleaning tools."
  ]
}
