{
  "code": "5.09",
  "parentCode": "5",
  "title": "Buildings and Grounds",
  "appliesTo": [
    "building maintenance",
    "structural integrity",
    "lighting",
    "ventilation",
    "facility infrastructure"
  ],
  "description": "Requirements for building and grounds maintenance including structural integrity, lighting, ventilation, drains, walls and ceilings, doors and windows, and prevention of facility-related contamination",
  "requirements": [
    {
      "code": "5.09.01",
      "question": "Are all lights in the facility that could potentially contaminate raw materials, work in progress, ingredients (including ice), finished goods, equipment or packaging shielded, coated or otherwise shatter resistant to protect product from contamination in the event of breakage?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.02",
      "question": "Has the operation eliminated or adequately controlled any potential metal, glass or brittle plastic contamination issues?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.03",
      "question": "Has the facility eliminated or adequately controlled the use of wooden items or surfaces?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.04",
      "question": "Is there adequate lighting in the production and storage areas?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.05",
      "question": "Is ventilation adequate to control dust, condensation, odors and vapors?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.06",
      "question": "Are floor surfaces in good condition, with no standing water, no debris trapping cracks and are they easy to clean?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.07",
      "question": "Are there floor drains and waste trap systems located where they are needed for drainage?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.08",
      "question": "Are exterior doors kept closed and are closed doors and windows to the outside pest-proof?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.09",
      "question": "Are dock load levelers and buffers/shelters maintained in good condition, pest proof and debris free?",
      "totalPoints": 3,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.10",
      "question": "Are exterior walls free of holes to exclude pests, and are pipes, vents, and air ducts designed and protected in order to prevent pest entry (e.g., by using fine mesh)?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.11",
      "question": "Are interior walls and ceilings free of cracks and crevices to prevent pest harborage and allow proper sanitation?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.12",
      "question": "Is an 18\" (46 cm) internal wall perimeter being maintained within the facility, with adequate access to these wall perimeters, thereby allowing inspection and cleaning?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.13",
      "question": "Is the exterior area immediately outside the facility, including roads, yards and parking areas, free of litter, weeds and standing water?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.14",
      "question": "Are control measures being implemented for the outside storage of equipment, pallets, tires, etc. (i.e., out of the mud, pipe ends capped, stacked to prevent pest harborage, away from the building perimeter)?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.15",
      "question": "Are pallets inspected to separate and replace dirty or broken pallets, and broken or dirty pallets are not in use?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.16",
      "question": "Is the area around the dumpster/cull truck/trash area clean?",
      "totalPoints": 3,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.17",
      "question": "Are outside garbage receptacles and dumpsters kept covered or closed?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.18",
      "question": "Are all water lines protected against back siphonage?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.09.19",
      "question": "Where there is an on-site laboratory, is it completely enclosed and separated from production and storage areas?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement shatter-resistant light protection program with inspection schedules, documentation of protective measures (sleeves, coatings, shields), and replacement protocols for damaged protections.",
    "Establish ventilation system maintenance program with filter replacement schedules, airflow direction verification, condensation management procedures, and microbial monitoring for high-risk areas.",
    "Create drain maintenance program with cleaning schedules, trap inspection protocols, backflow prevention verification, and slope assessments to ensure proper drainage.",
    "Develop wall, ceiling, and floor integrity inspection program with documentation of cracks, holes, or damage findings and prioritized repair schedules based on contamination risk.",
    "Implement door and window maintenance program with pest exclusion inspections, seal integrity verification, automatic door function testing, and screen condition assessments."
  ],
  "traceabilityInject": [
    "Maintain light fixture inspection logs showing dates, locations, protective measure status, findings of broken or missing protection, corrective actions, and verification of repairs.",
    "Document ventilation system maintenance records including filter replacement dates, airflow measurements, condensation observations, cleaning activities, and microbial test results for air quality.",
    "Keep drain system inspection and maintenance logs showing cleaning dates, trap inspections, findings of blockages or backflow, repairs performed, and verification of proper function.",
    "Maintain building integrity inspection records documenting dates, areas inspected, findings of structural damage, pest entry points identified, repair work orders, and completion verification.",
    "Keep pest exclusion maintenance logs for doors and windows showing inspection dates, findings of gaps or damage, seal replacements, screen repairs, and verification of pest exclusion effectiveness."
  ],
  "micro_inject": [
    "Broken lights can shatter and contaminate products with glass fragments; lack of protective measures creates unacceptable physical hazard risks and potential for product recalls.",
    "Poor ventilation creates condensation that promotes Listeria growth on ceilings and walls; condensate dripping onto product or food contact surfaces directly introduces environmental pathogens.",
    "Drains with standing water or backflow issues become Listeria reservoirs; aerosols from drain systems spread pathogens throughout production areas via air currents and splash.",
    "Cracks in walls, ceilings, and floors provide harborage for pests and protect bacteria from cleaning chemicals; these niches allow pathogen populations to persist and recontaminate cleaned areas.",
    "Gaps around doors and windows allow pest entry including flies, rodents, and birds that introduce pathogens; inadequate pest exclusion compromises all other sanitation efforts."
  ]
}
