{
  "code": "5.10",
  "parentCode": "5",
  "title": "Site",
  "appliesTo": [
    "site planning",
    "facility layout",
    "site maps",
    "adjacent land use",
    "environmental factors"
  ],
  "description": "Requirements for site planning and documentation including site maps, facility layout, adjacent land use considerations, and environmental factors affecting food safety",
  "requirements": [
    {
      "code": "5.10.01",
      "question": "Is there a site plan showing the facility location, adjacent sites, roads, water sources, storm water, wastewater and other relevant features?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.10.02",
      "question": "Is there a facility floor plan showing the layout of the building, production areas, storage areas, water sources and fixtures, layout of equipment and traffic flow patterns?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.10.03",
      "question": "Has a documented risk assessment been performed to ensure that any food safety hazards relevant to facility location and adjacent land use are identified and controlled?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.10.04",
      "question": "Is there a current certificate of inspection (or similar record) for backflow prevention assemblies on water lines into the facility?",
      "totalPoints": 3,
      "isAutomaticFailure": false
    },
    {
      "code": "5.10.05",
      "question": "Is there a trained on-site person responsible for the operation's food safety program?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Establish corrective action procedures for addressing facility location risks identified through documented risk assessments",
    "Implement preventive measures to control environmental hazards from adjacent land use that could affect food safety",
    "Develop procedures for immediate remediation when backflow prevention devices fail certification inspections",
    "Create action plans for updating site plans and facility layouts when changes occur to production areas or traffic flow",
    "Establish verification procedures to ensure food safety program responsibilities are properly assigned and maintained"
  ],
  "traceabilityInject": [
    "Maintain current site plans showing facility location, adjacent sites, roads, water sources, and environmental features with revision dates",
    "Keep updated facility floor plans documenting production areas, storage locations, equipment layout, and traffic flow patterns",
    "Retain documented risk assessments for facility location and adjacent land use with dates and approval signatures",
    "Archive certificates of inspection for backflow prevention assemblies with testing dates and expiration tracking",
    "Document assignment of food safety responsibilities including training records and competency verification for designated personnel"
  ],
  "micro_inject": [
    "Uncontrolled water sources near the facility may introduce pathogenic microorganisms through cross-contamination or flooding events",
    "Adjacent agricultural operations or waste management sites can harbor Salmonella, E. coli, and Listeria that may migrate to processing areas",
    "Inadequate site drainage and storm water management creates conditions favorable for microbial growth and pest harborage",
    "Backflow events in water systems can introduce fecal coliforms and other pathogenic bacteria into food processing water supplies",
    "Poor facility layout with inadequate separation of raw and processed areas increases cross-contamination risks from environmental pathogens"
  ]
}
