{
  "code": "5.15",
  "parentCode": "5",
  "title": "Worker Documentation",
  "appliesTo": [
    "worker documentation",
    "training records",
    "hygiene training",
    "competency assessments",
    "personnel files"
  ],
  "description": "Requirements for worker-related documentation including training records, hygiene training, illness reporting procedures, competency assessments, and personnel file management",
  "requirements": [
    {
      "code": "5.15.01",
      "question": "Are there records of new worker food safety (GMP) orientation training (with topics covered and attendees) and are all workers required to sign the company's food safety hygiene and health policy?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.15.02",
      "question": "Are there logs of ongoing worker food safety education training, including topics covered, attendees, etc.?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.15.03",
      "question": "Are there training logs for the sanitation workers, including best practices and chemical use details?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.15.04",
      "question": "Are there written and communicated procedures in place that require food handlers to report any cuts or grazes and/or if they are suffering any illnesses that might be a contamination risk to the products being produced, and include return to work requirements? (In countries with health privacy/confidentiality laws, e.g., USA, auditors should check procedure/policy but not the actual records).",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.15.05",
      "question": "Are there worker food safety non-conformance records and associated corrective actions (including retraining records)?",
      "totalPoints": 3,
      "isAutomaticFailure": false
    },
    {
      "code": "5.15.06",
      "question": "Are visitors and contractors required to sign a log stating that they will comply with the operations' personal hygiene and health requirements?",
      "totalPoints": 3,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement retraining procedures for workers who demonstrate food safety violations or fail to follow Good Manufacturing Practices",
    "Establish corrective actions when workers fail to report illnesses or injuries that could contaminate products including immediate removal from production",
    "Develop procedures for addressing gaps in worker food safety training records including immediate training and competency verification",
    "Create preventive measures when sanitation worker practices deviate from documented procedures including supervision and skill assessment",
    "Implement verification procedures to ensure visitor and contractor hygiene compliance logs are properly maintained and violations are addressed"
  ],
  "traceabilityInject": [
    "Maintain new worker orientation training records documenting Good Manufacturing Practices, food safety hygiene topics, and signed policy acknowledgments",
    "Keep ongoing food safety education training logs including dates, topics covered, attendee lists, and trainer signatures",
    "Retain sanitation worker training documentation covering best practices, chemical handling procedures, and competency assessments",
    "Document illness and injury reporting procedures including communication protocols and return-to-work requirements per privacy regulations",
    "Archive worker non-conformance records with corrective actions taken, retraining completion, and follow-up verification results"
  ],
  "micro_inject": [
    "Inadequately trained workers may fail to recognize cross-contamination risks allowing transfer of Salmonella from raw to processed products",
    "Workers with unreported gastrointestinal illnesses can shed norovirus, Hepatitis A, or pathogenic E. coli contaminating food contact surfaces",
    "Poor hand hygiene practices by food handlers introduce fecal coliforms and Staphylococcus aureus onto ready-to-eat products",
    "Insufficient understanding of allergen controls leads to cross-contact allowing allergenic proteins to contaminate non-allergen products",
    "Failure to follow sanitation procedures allows persistence of Listeria monocytogenes in processing environments through inadequate cleaning"
  ]
}
