{
  "code": "5.17",
  "parentCode": "5",
  "title": "Temperature Controlled Storage & Distribution Logs",
  "appliesTo": [
    "temperature control",
    "cold chain management",
    "temperature monitoring",
    "alarm systems",
    "temperature deviations"
  ],
  "description": "Requirements for temperature control documentation including temperature monitoring logs, cold chain management, equipment calibration, alarm systems, and corrective action records for temperature deviations",
  "requirements": [
    {
      "code": "5.17.01",
      "question": "Are there records of final product temperature checks for temperature sensitive product?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.17.02",
      "question": "Are there temperature logs for the production area (if refrigerated)?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.17.03",
      "question": "Are there temperature logs for storage rooms?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.17.04",
      "question": "Is there a documented procedure for checking truck trailer temperature and reviewing sanitary condition of truck trailers prior to loading?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.17.05",
      "question": "Are there records of shipping truck trailer (or other transportation systems) temperature checks, indicating the truck trailer temperature settings and that the truck trailer was pre-cooled prior to loading?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "5.17.06",
      "question": "Are there sanitary condition logs for shipping truck trailers (or other transportation systems)?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement immediate corrective actions when product temperatures exceed specified limits including evaluation for disposition or destruction",
    "Establish procedures for addressing refrigerated storage area temperature deviations including equipment service and product safety assessment",
    "Develop action plans when truck trailers arrive without proper pre-cooling including rejection criteria and carrier notification",
    "Create preventive measures for temperature monitoring equipment including calibration schedules and alarm system verification testing",
    "Implement verification procedures to ensure truck sanitation issues are corrected before loading and carriers maintain hygiene standards"
  ],
  "traceabilityInject": [
    "Maintain final product temperature check records for all temperature-sensitive products with time stamps and corrective actions when out of range",
    "Keep refrigerated production area temperature logs documenting continuous monitoring or periodic checks with alarm event records",
    "Retain storage room temperature logs showing compliance with specified ranges including automated system data and manual verification",
    "Document truck trailer temperature verification procedures including pre-cooling confirmation, set point verification, and loading protocols",
    "Archive truck sanitary condition inspection logs noting cleanliness, odors, structural integrity, and rejection documentation when applicable"
  ],
  "micro_inject": [
    "Temperature abuse above 41°F allows rapid multiplication of Listeria monocytogenes in ready-to-eat refrigerated products during storage",
    "Inadequate refrigeration permits growth of psychrotrophic pathogens including Yersinia enterocolitica and non-proteolytic Clostridium botulinum",
    "Warm truck trailers allow mesophilic pathogens like Salmonella and E. coli to proliferate rapidly during transportation to distribution",
    "Temperature fluctuations during storage create condensation promoting microbial growth and cross-contamination from environmental sources",
    "Unsanitary truck conditions introduce extraneous contamination including fecal material harboring enteric pathogens onto packaged products"
  ]
}
