{
  "code": "5.18",
  "parentCode": "5",
  "title": "Allergen Control",
  "appliesTo": [
    "allergen management",
    "allergen identification",
    "allergen segregation",
    "cross-contact prevention",
    "labeling accuracy"
  ],
  "description": "Comprehensive allergen management requirements including allergen identification, segregation, cleaning procedures, labeling accuracy, cross-contact prevention, and allergen control program documentation",
  "requirements": [
    {
      "code": "5.18.01",
      "question": "Does the operation handle or store any food allergens? Information gathering question",
      "totalPoints": 0,
      "isAutomaticFailure": false
    },
    {
      "code": "5.18.02",
      "question": "Are there adequate storage controls (e.g., separation, identification, etc.) that ensure that allergens are not contaminating other raw materials?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.18.03",
      "question": "Is there a dedicated allergen production line or adequate clean down and production procedures that prevent allergen cross contamination?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.18.04",
      "question": "Are utensils and work in progress storage containers identified in order to prevent allergen cross contamination?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.18.05",
      "question": "Does re-work handling take into account the issues associated with allergen containing products?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.18.06",
      "question": "Are workers trained with respect to allergen risks and the facility allergen cross contamination controls (including hand washing between production runs) and are there records of this allergen training?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.18.07",
      "question": "Are worker practices adequate and being followed to protect against allergen cross-contact and against contamination of food?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    },
    {
      "code": "5.18.08",
      "question": "Are all products manufactured on site labeled correctly with respect to allergens?",
      "totalPoints": 5,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement immediate corrective actions when allergen cross-contact is detected including product hold, recall evaluation, and enhanced cleaning verification",
    "Establish procedures for addressing inadequate allergen segregation in storage including physical barriers and clear identification systems",
    "Develop action plans when allergen cleaning validation fails including equipment redesign and enhanced sanitation procedures",
    "Create preventive measures for production scheduling to minimize allergen changeovers and reduce cross-contact opportunities",
    "Implement verification procedures to ensure allergen training effectiveness through competency testing and observation of worker practices"
  ],
  "traceabilityInject": [
    "Maintain allergen inventory documentation showing all allergenic ingredients received, stored, and used in production with lot identification",
    "Keep records of allergen storage controls including segregation methods, identification systems, and inspection verification logs",
    "Retain allergen production line cleaning logs documenting procedures, verification testing results, and supervisor approval before non-allergen runs",
    "Document allergen training records for all workers including cross-contact prevention, cleaning procedures, and emergency response protocols",
    "Archive product label verification records ensuring accurate allergen declarations and precautionary statements meet regulatory requirements"
  ],
  "micro_inject": [
    "While allergen control primarily addresses allergenic proteins, inadequate cleaning between allergen runs creates organic residues supporting microbial growth",
    "Equipment surfaces with allergenic material buildup provide nutrients supporting biofilm formation that can harbor Listeria monocytogenes",
    "Shared production lines without proper sanitation between allergen and non-allergen products may allow cross-contamination of both allergens and pathogens",
    "Rework handling procedures that fail to address allergen segregation also increase risk of microbial contamination through extended holding times",
    "Inadequate hand washing between allergen production runs allows transfer of both allergenic proteins and pathogenic microorganisms including Staphylococcus aureus"
  ]
}
