{
  "code": "7.02",
  "parentCode": "7",
  "title": "Development of the Food Safety Plan",
  "appliesTo": [
    "hazard analysis",
    "preventive controls",
    "critical limits",
    "monitoring procedures",
    "validation"
  ],
  "description": "Requirements for Food Safety Plan development including hazard analysis, preventive controls identification, critical limits establishment, monitoring procedures, corrective actions, verification activities, and validation documentation",
  "requirements": [
    {
      "code": "7.02.01",
      "question": "Has a documented hazard analysis for each product (or product group) been conducted, showing the various types of hazards, their likelihood of occurrence, their associated severity and their preventive controls? This question must be scored. NA is not allowed.",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.02",
      "question": "Where risk-based preventive controls are identified, have reasonably appropriate procedures, practices, and processes been developed to control identified hazard(s) are they appropriate and consistent with current scientific understanding?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.03",
      "question": "Do the process preventive controls have critical limits, supported by relevant validation documentation, and do allergen, sanitation, supply chain or other preventive controls have parameters, values and targets (where relevant)?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.04",
      "question": "Have monitoring requirements and frequencies been determined and documented for the preventive controls?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.05",
      "question": "Are there documents that show validation work for the process preventive controls and was this validation work performed by or overseen by a Preventive Controls Qualified Individual?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.06",
      "question": "Do the Food Safety Plan, charts and/or procedures indicate that specific responsibilities have been assigned for the monitoring, recording, verification, and corrective action implementation?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.07",
      "question": "Have standard operating procedures (SOPs) been created for the monitoring process(es) of the preventive controls, including those in plan or chart format (e.g., process preventive controls)?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.08",
      "question": "Have corrective action procedures been established for the preventive controls, including a detailed action plan for operators to follow if out of specification situations are observed (loss of control/deviation) and plans to adjust process back into control?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.09",
      "question": "Have recording forms been developed for monitoring the preventive controls?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.10",
      "question": "Have verification procedures and schedules been developed for the preventive controls?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.11",
      "question": "If any preventive control has been identified, does the operation have a documented and implemented recall plan?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "7.02.12",
      "question": "Is there documented evidence that the food safety plan (primary documents in the preventive controls food safety system) has been verified on-site?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement immediate corrective actions when hazard analysis identifies uncontrolled biological hazards requiring new preventive control implementation",
    "Establish procedures for revising preventive controls when validation data demonstrates current measures are insufficient to control identified hazards",
    "Develop action plans when critical limits or parameters are not supported by adequate scientific validation requiring expert consultation or testing",
    "Create preventive measures when monitoring procedures prove inadequate to detect control deviations before food safety is compromised",
    "Implement verification procedures to ensure PCQI oversight of all preventive control validation activities and documentation"
  ],
  "traceabilityInject": [
    "Maintain documented hazard analysis for each product showing biological, chemical, and physical hazards with likelihood, severity, and preventive controls",
    "Keep preventive control documentation showing procedures, practices, and processes developed to control each identified hazard",
    "Retain validation records for process preventive controls including scientific studies, challenge studies, and PCQI review documentation",
    "Document monitoring procedures specifying parameters measured, frequencies, methods, and assigned responsibilities for each preventive control",
    "Archive on-site verification records confirming Food Safety Plan documents accurately reflect actual processes and control implementation"
  ],
  "micro_inject": [
    "Inadequate hazard analysis fails to identify Listeria monocytogenes environmental contamination as preventive control requiring environmental monitoring programs",
    "Preventive controls not validated for their specific application may be insufficient to eliminate pathogenic Salmonella in low-moisture foods",
    "Critical limits unsupported by science allow Bacillus cereus and Clostridium perfringens survival in cooling processes due to inadequate time-temperature control",
    "Insufficient monitoring frequencies miss rapid microbial growth periods allowing pathogen multiplication to dangerous levels between checks",
    "Lack of PCQI validation oversight results in preventive controls that fail to achieve required log reductions for E. coli O157:H7 in produce"
  ]
}
