{
  "code": "7.03",
  "parentCode": "7",
  "title": "Execution of the Food Safety Plan",
  "appliesTo": [
    "preventive control training",
    "monitoring compliance",
    "worker competency",
    "record-keeping",
    "corrective actions"
  ],
  "description": "Requirements for Food Safety Plan implementation including preventive control training, monitoring compliance, worker competency, record-keeping, corrective action execution, and verification of control effectiveness",
  "requirements": [
    {
      "code": "7.03.01",
      "question": "Is there documented evidence that all plant workers have attended a preventive control training, including specific training for workers directly involved with preventive controls?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "7.03.02",
      "question": "Are the preventive control monitoring activities and frequencies in compliance with the Food Safety Plan, charts, and procedures?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.03.03",
      "question": "Do workers directly involved with preventive control operations understand basic preventive control principles and their role in monitoring preventive controls?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "7.03.04",
      "question": "Are preventive control associated records signed off (or initialed) by the workers who are carrying out and recording the preventive control activities?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.03.05",
      "question": "Is there a deviation record detailing documented corrective actions when a deviation or deficiency of a preventive control occurs?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "7.03.06",
      "question": "Are the records associated with preventive controls verified and signed off by a preventive controls qualified individual or trained designate (second signatory)?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement retraining procedures for workers who fail to demonstrate competency in preventive control operations or monitoring techniques",
    "Establish corrective actions when preventive control monitoring deviates from Food Safety Plan specifications requiring immediate compliance restoration",
    "Develop action plans when worker understanding of preventive controls is inadequate requiring enhanced training and competency verification",
    "Create preventive measures when preventive control records show incomplete data, missing signatures, or data inconsistencies requiring oversight improvements",
    "Implement verification procedures to ensure PCQI or designate review occurs timely and effectively identifies all control deviations"
  ],
  "traceabilityInject": [
    "Maintain preventive control training records for all workers including specific training for those directly involved with control operations",
    "Keep preventive control monitoring logs showing compliance with documented frequencies and procedures with operator signatures",
    "Retain competency assessment records demonstrating workers understand preventive control principles and their monitoring responsibilities",
    "Document deviation records for all preventive control failures including corrective actions, product safety evaluations, and approval signatures",
    "Archive PCQI or trained designate verification records showing timely review of preventive control monitoring data with second signatures"
  ],
  "micro_inject": [
    "Inadequately trained workers fail to properly monitor sanitizer concentrations allowing Listeria monocytogenes survival on food contact surfaces",
    "Poor understanding of preventive controls results in operators not recognizing when allergen segregation failures create cross-contamination opportunities",
    "Monitoring compliance failures miss temperature control deviations that permit rapid Salmonella multiplication in temperature-sensitive ingredients",
    "Incomplete preventive control records mask sanitation failures allowing persistent environmental contamination with pathogenic bacteria",
    "Lack of PCQI oversight allows repeated control deviations creating conditions favorable for Bacillus cereus spore germination and toxin production"
  ]
}
