{
  "code": "6.02",
  "parentCode": "6",
  "title": "HACCP Plan Requirements",
  "appliesTo": [
    "hazard analysis",
    "CCP determination",
    "critical limits",
    "monitoring procedures",
    "corrective actions"
  ],
  "description": "Core HACCP plan requirements including documented hazard analysis, Critical Control Point (CCP) determination, critical limits, monitoring procedures, corrective actions, verification activities, and annual review",
  "requirements": [
    {
      "code": "6.02.01",
      "question": "Has a documented hazard analysis for the processes been conducted, showing the various types of hazards, their likelihood of occurrence, their associated severity and their control measures? A ZERO POINT (NON-CONFORMANCE) DOWN SCORE IN THIS QUESTION RESULTS IN AUTOMATIC FAILURE OF THIS AUDIT.",
      "totalPoints": 15,
      "isAutomaticFailure": true
    },
    {
      "code": "6.02.02",
      "question": "Have CCP decisions been made with logical, documented justification and where CCPs are implemented in a specific processing step, have they been developed to control the identified hazard(s)? This question must be scored. Scoring N/A is not allowed.",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.03",
      "question": "Is the HACCP system reviewed when significant changes are made and at least once every 12 months?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.04",
      "question": "Have critical control point (CCP) processing steps been identified that eliminate or reduce food safety hazards to an acceptable level? Information gathering. If the answer is YES, continue with the next question. If the answer is NO, the rest of \"Module 6 HACCP\" is not applicable. Where the auditor finds error(s) in the logic applied, e.g., a step meets the requirements for a CCP, but it is not identified as such, the issue should be detailed here, and the rest of Module 6 is applicable and should be scored.",
      "totalPoints": 0,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.05",
      "question": "Have CCP critical control limits been established and are they supported by relevant validation documentation?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.06",
      "question": "Have monitoring requirements and frequencies been determined and documented for the CCPs?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.07",
      "question": "Have specific responsibilities been assigned for the monitoring, recording and corrective action implementation of each CCP?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.08",
      "question": "Have standard operating procedures (SOPs) been created for the monitoring process(es) of the CCPs, which would include how to carry out the monitoring activities?",
      "totalPoints": 10,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.09",
      "question": "Have corrective action procedures been established for the CCPs, including a detailed action plan for operators to follow if the critical control limits are not met (loss of control/deviation) and plans to adjust the process back into control?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.10",
      "question": "Have recording forms been developed for monitoring the CCPs?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    },
    {
      "code": "6.02.11",
      "question": "Have verification plans and schedules been developed for each CCP?",
      "totalPoints": 15,
      "isAutomaticFailure": false
    }
  ],
  "capaInject": [
    "Implement immediate corrective actions when hazard analysis identifies uncontrolled biological hazards requiring CCP establishment or control reassessment",
    "Establish procedures for revising CCP decisions when validation data demonstrates controls are insufficient to eliminate identified hazards",
    "Develop action plans when critical limits are exceeded at CCPs including product disposition, process adjustment, and enhanced monitoring",
    "Create preventive measures when monitoring frequencies prove inadequate to detect CCP deviations before loss of control occurs",
    "Implement verification procedures to ensure HACCP system reviews occur on schedule and address all significant process changes"
  ],
  "traceabilityInject": [
    "Maintain documented hazard analysis showing biological, chemical, and physical hazards with likelihood, severity, and control measure justification",
    "Keep CCP determination records including decision tree application, scientific justification, and approval by HACCP team leader",
    "Retain critical limit validation documentation including scientific studies, regulatory guidance, and expert consultation supporting established limits",
    "Document monitoring procedures for each CCP specifying what is monitored, how, when, frequency, and responsible personnel",
    "Archive HACCP system review records conducted at least annually and when significant changes occur, including modifications made and approval signatures"
  ],
  "micro_inject": [
    "Hazard analysis that fails to identify pathogenic E. coli O157:H7 in raw produce results in inadequate CCPs for microbial reduction",
    "Incorrectly determined CCPs allow Salmonella survival in cooking processes due to insufficient time-temperature combinations",
    "Critical limits not validated by scientific data may permit Listeria monocytogenes growth in refrigerated products during shelf life",
    "Inadequate CCP monitoring frequencies miss temperature abuse events allowing rapid multiplication of Bacillus cereus and Clostridium perfringens",
    "Failure to review HACCP system after process changes allows introduction of new pathogen hazards including cross-contamination from environmental sources"
  ]
}
